//1.Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
// --------------------------------
// int a = 10;
// int b = 3;
// int c = a % b;
// Console.WriteLine(c);

// 2. Пользователь вводит с клавиатуры 2 числа: основание степени и показатель
//степени. Необходимо возвести число во введенную степень

// P.S. делал 1 способом, но понял что напрямую в степень не возводит порылся в документации 
// понял, что для того, чтобы возвести в степень, нужно вызвать метод Pow, 
// прочитал что метод принимает значения типа double, затестил с byte, всё норм
// int d = Convert.ToByte(Console.ReadLine());
// int e = Convert.ToByte(Console.ReadLine());
// int f = d ^ e;
// Console.WriteLine(f);
//----------------------------

// byte d = Convert.ToByte(Console.ReadLine());
// byte e = Convert.ToByte(Console.ReadLine());
// Console.WriteLine($"{d}^{e} = " + Math.Pow(d, e));

